w1.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <env:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" env:mustUnderstand="1">
      <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Id-oaPL_yfUam7AbRscGR_cnCQz">
        <wsse:Username>#Username#</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">#Password#</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
    <info:hmrcInfo xmlns:info="http://www.govtalk.gov.uk/hmrcinfo/">    <info:VendorDetails>
      <info:VendorIdentity>
        <info:VendorName>#VendorName#</info:VendorName>
        <info:VendorURI>#VendorURI#</info:VendorURI>
        <info:VendorID>#VendorId#</info:VendorID>
      </info:VendorIdentity>
      <info:VendorProduct>
        <info:VendorProductName>#VendorProductName#</info:VendorProductName>
        <info:VendorProductVersion>#VendorProductVersion#</info:VendorProductVersion>
      </info:VendorProduct>
    </info:VendorDetails>
</info:hmrcInfo>
  </env:Header>
  <env:Body>
<n1:submitW1Declaration xmlns:n1="http://webservices.hmrc.gov.uk/ws/atwd/28022008">
	&lt;WarehouseReturn xmlns="http://www.govtalk.gov.uk/atwd/WarehouseReturn/02102007" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
		&lt;warehouseID&gt;#warehouseID#&lt;/warehouseID&gt;
		&lt;periodStartDate&gt;#periodStartDate#&lt;/periodStartDate&gt;
		&lt;periodEndDate&gt;#periodEndDate#&lt;/periodEndDate&gt;
		&lt;currencyCode&gt;#currencyCode#&lt;/currencyCode&gt;

		<!--#Products#-->
		<!--#OutstandingAADs#-->
		<!--#ReturnedShortageAADs#-->
		<!--#OutstandingW8s#-->
		<!--#ReturnedShortageW8s#-->
		<!--#CeasedOwners#-->
		
	&lt;/WarehouseReturn&gt;
</n1:submitW1Declaration>
  </env:Body>
</env:Envelope>